debug_infos/20260713_current_best_h11_5_h10_8_plus_h10_only/original/baselines/official/throughput/throughput_all/bench.log
===== throughput: 4-8K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f27c6cb49d0>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./4-8K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260710_040000_official_baseline_full_all/throughput_all/results/4-8K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-abe3165e-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-10 11:51:13 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [02:15<00:00, 67.72s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [17:00<00:00, 20.42s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  1020.92   
Total input tokens:                      315769    
Total generated tokens:                  12463     
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         12.21     
Peak output token throughput (tok/s):    16.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          321.51    
---------------Time to First Token----------------
Mean TTFT (ms):                          3370.28   
Median TTFT (ms):                        3577.08   
P50 TTFT (ms):                           3577.08   
P95 TTFT (ms):                           4480.41   
P99 TTFT (ms):                           4792.48   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          68.56     
Median TPOT (ms):                        68.63     
P50 TPOT (ms):                           68.63     
P95 TPOT (ms):                           68.85     
P99 TPOT (ms):                           68.96     
---------------Inter-token Latency----------------
Mean ITL (ms):                           68.33     
Median ITL (ms):                         68.63     
P50 ITL (ms):                            68.63     
P95 ITL (ms):                            69.21     
P99 ITL (ms):                            69.82     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          20402.79  
Median E2EL (ms):                        9657.01   
P50 E2EL (ms):                           9657.01   
P95 E2EL (ms):                           73803.49  
P99 E2EL (ms):                           74606.05  
==================================================
===== throughput: 8-16K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f08d5f089d0>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./8-16K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260710_040000_official_baseline_full_all/throughput_all/results/8-16K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-dbc617e8-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-10 12:10:59 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:37<00:00, 18.68s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [25:53<00:00, 31.08s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  1553.78   
Total input tokens:                      664763    
Total generated tokens:                  13690     
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         8.81      
Peak output token throughput (tok/s):    16.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          436.65    
---------------Time to First Token----------------
Mean TTFT (ms):                          12051.39  
Median TTFT (ms):                        12687.38  
P50 TTFT (ms):                           12687.38  
P95 TTFT (ms):                           15619.67  
P99 TTFT (ms):                           24886.19  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          69.71     
Median TPOT (ms):                        69.70     
P50 TPOT (ms):                           69.70     
P95 TPOT (ms):                           70.36     
P99 TPOT (ms):                           70.37     
---------------Inter-token Latency----------------
Mean ITL (ms):                           69.43     
Median ITL (ms):                         69.71     
P50 ITL (ms):                            69.71     
P95 ITL (ms):                            70.49     
P99 ITL (ms):                            71.01     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          31060.01  
Median E2EL (ms):                        18706.29  
P50 E2EL (ms):                           18706.29  
P95 E2EL (ms):                           79888.87  
P99 E2EL (ms):                           82050.64  
==================================================
===== throughput: 16-32K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7feb4bca89d0>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./16-32K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260710_040000_official_baseline_full_all/throughput_all/results/16-32K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-a131a39c-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-10 12:38:01 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:52<00:00, 26.18s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [36:21<00:00, 43.64s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  2181.75   
Total input tokens:                      1078097   
Total generated tokens:                  11760     
Request throughput (req/s):              0.02      
Output token throughput (tok/s):         5.39      
Peak output token throughput (tok/s):    15.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          499.53    
---------------Time to First Token----------------
Mean TTFT (ms):                          26828.76  
Median TTFT (ms):                        27072.60  
P50 TTFT (ms):                           27072.60  
P95 TTFT (ms):                           28607.85  
P99 TTFT (ms):                           28740.84  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          71.40     
Median TPOT (ms):                        71.55     
P50 TPOT (ms):                           71.55     
P95 TPOT (ms):                           71.78     
P99 TPOT (ms):                           71.82     
---------------Inter-token Latency----------------
Mean ITL (ms):                           71.39     
Median ITL (ms):                         71.72     
P50 ITL (ms):                            71.72     
P95 ITL (ms):                            72.30     
P99 ITL (ms):                            72.92     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          43619.41  
Median E2EL (ms):                        39053.32  
P50 E2EL (ms):                           39053.32  
P95 E2EL (ms):                           101869.19 
P99 E2EL (ms):                           102159.96 
==================================================

===== result files =====
/public/home/tangyu408/testdata/goal_runs/20260710_040000_official_baseline_full_all/throughput_all/results/8-16K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260710_040000_official_baseline_full_all/throughput_all/results/16-32K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260710_040000_official_baseline_full_all/throughput_all/results/4-8K_throughput/result.json